#Написать искатор собственных значений и собственных векторов (хотя бы один) для матриц размера 2 на 2


A=[[0]*2 for _ in range(2)]
for i in range(2):
    A[i]=[int(x) for x in input().split()]
a1=A[0][0]
b1=A[0][1]
c1=A[1][0]
d1=A[1][1]
a=1
b=(a1+d1)*(-1)
c=a1*d1-b1*c1
K1=((-1)*b+((b*b-4*a*c)**0.5))/2       #корень
K2=((-1)*b-((b*b-4*a*c)**0.5))/2       #корень
try:
    try:
        x1=1
        x2=c1*x1/(K1-d1)
        print('число',K1, 'вектор',x1, x2)
    except:
        x2=1
        x1=b1*x2/(K1-a1)
        print('число', K1, 'вектор', x1, x2)
    try:
        x1=1
        x2=c1*x1/(K2-d1)
        print('число',K2, 'вектор',x1, x2)
    except:
        x2=1
        x1=b1*x2/(K2-a1)
        print('число', K2, 'вектор', x1, x2)
except:
    print('число', 0, 'вектор', 1, 0)

